class phoneData:
    def phoneDepartment (self):
        phoneDepartment = [
            ['학사종합지원센터','031-330-4028','031-330-4086','031-330-4027'],
            ['학생지원팀(장학)','031-330-4033','031-330-4034','031-330-4035','031-330-4038'],
            ['진로취업센터','031-330-4040','031-330-4041','031-330-4042','031-330-4636'],
            ['도서관','031-330-4122','031-330-4123','031-330-4124','031-330-4125','031-330-4533'],
            ['기숙사','031-330-4102','031-330-4103','031-330-4793','031-330-4794'],
            ['원스톱서비스센터','031-330-4636'],
            ['우체국','031-330-4198'],
            ['서점','031-330-4821'],
            ['문구점','031-330-4812'],
            ['안경점','031-330-4814'],
            ['ENGLISH ZONE','031-330-4720'],
            ['어문관복사실','031-330-4197'],
            ['학생화관복사실','031-330-4820'],
            ['창업교육센터','031-330-4691'],
            ['사회봉사센터','031-330-4035'],
            ['예비군연대','031-330-4111'],
            ['시설관리팀','031-330-4008'],
        ]
        return phoneDepartment

    def phoneMajor(self):
        phoneMajor = [
            ['철학과','031-330-4282'],
            ['사학과','031-330-4288'],
            ['언어인지과학과','031-330-4286'],
            ['지식콘텐츠학부','031-330-4980'],
            ['영어통번역학부','031-330-4202'],
            ['독일어통번역학과','031-330-4206'],
            ['스페인어통번역학과','031-330-4210'],
            ['이탈리아어통번역학과','031-330-4214'],
            ['중국어통번역학과','031-330-4232'],
            ['일본어통번역학과','031-330-4234'],
            ['아랍어통번역학과','031-330-4236'],
            ['말레이·인도네시아어통번역학과','031-330-4238'],
            ['태국어통번역학과','031-330-4240'],
            ['폴란드어과','031-330-4216'],
            ['루마니아어과','031-330-4218'],
            ['체코·슬로바키아어과','031-330-4220'],
            ['헝가리어과','031-330-4222'],
            ['세르비아·크로아티아어과','031-330-4224'],
            ['우크라이나어과','031-330-4873'],
            ['프랑스학과','031-330-4204'],
            ['브라질학과','031-330-4212'],
            ['그리스·불가리아학과','031-330-4715'],
            ['아프리카학부','031-330-4242'],
            ['인도학과','031-330-4244'],
            ['중앙아시아학과','031-330-4716'],
            ['러시아학과','031-330-4208'],
            ['국제스포츠레저학부','031-330-4524'],
            ['한국학과','031-330-4217'],
            ['국제경영학과','031-330-4248'],
            ['경제학과','031-330-4250'],
            ['경영정보학과','031-330-4252'],
            ['GBT학부','031-330-4509'],
            ['국제금융학부','031-330-4981'],
            ['수학과','031-330-4262'],
            ['전자물리학과','031-330-4264'],
            ['화학과''031-330-4266'],
            ['환경학과','031-330-4270'],
            ['생명공학과','031-330-4272'],
            ['통계학과','031-330-4278'],
            ['디지털정보공학과','031-330-4297'],
            ['산업경영공학과','031-330-4098'],
            ['전자공학과','031-330-4094'],
            ['정보통신공학과','031-330-4255'],
            ['컴퓨터·전자시스템공학부','031-330-4268']
        ]
        return phoneMajor

    def phoneChicken(self):
        phoneChicken =[
            ['미쳐버린파닭','031-333-6341'],
            ['치킨마루','031-334-5518'],
            ['BBQ','031-322-8292'],
            ['송엘림치킨','070-8722-8000'],
            ['또래오래','031-765-5592'],
            ['네네치킨','031-332-3434'],
            ['피자나라치킨공주','031-322-9244']
        ]
        return  phoneChicken

    def phonePizza(self):
        phonePizza =[
            ['피자나라치킨공주', '031-322-9244'],
            ['더더피자','031-334-0788'],
            ['피자스쿨','031-321-8834'],
            ['영구스피자','031-337-0988'],
        ]
        return phonePizza
    def phoneChina(self):
        phoneChina =[
            ['다래원','031-339-6481'],
            ['하이난','031-323-1595'],
        ]
        return phoneChina

    def phoneSnack(self):
        phoneSnack = [
            ['깁밥천국','031-333-6399'],
            ['엽기떡볶이','031-339-8592'],
            ['날으는김밥','031-321-6639'],
            ['김가네','031-323-2177'],
            ['신전떡볶이','0504-0952-9101'],
            ['리오브리또','031-335-123'],
            ['토마토도시락','031-000-0000']
        ]
        return phoneSnack

    def phoneFood(self):
        phoneFood = [
            ['마약곱창','031-323-1077'],
            ['엄마손칼국수','031-333-8917'],
            ['쭈구쭈구야','031-339-7357']
        ]
        return phoneFood

    def phoneJokbal(self):
        phoneJokbal = [
            ['불불이족발','031-328-6848'],
            ['고향왕족발','031-798-0195']
        ]
        return  phoneJokbal