class selectCalData:

    def selectCalData(self):
        calAll = []
        calAll.append([])
        calAll[0] = ['월','일정','이번달','고사','여름','겨울','졸시','휴학']
        calAll.append([])
        calAll[1] = ['1학기','2학기']
        calAll.append([])
        calAll[2] = ['전기','후기','중간','성적','동계','하계','수강','졸업','방학']
        calAll.append([])
        calAll[3] = ['개강','시험','기말','입력','확인','열람','정정','성적보고',
                     '심사', '논문','재입학','복학','등록기간','사정회의','학위',
                     '방학','계절','종강','신청','변경','취소','1/4','2/4','3/4']
        calAll.append([])
        calAll[4] = ['설날','삼일절','개교','근로자','어린이날','대체휴일','석가탄실일',
                     '현충일','광복절','추석','대체공휴일','개천절','한글날','성탄절']
        return calAll


